#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_iam_role_policy_attachment.eks_node_policy_attachment: Refreshing state... [id=eks_node_role-20230823124538213800000001]
aws_vpc.main: Refreshing state... [id=vpc-01b577384d221fe3d]
aws_iam_role.eks_node_role: Refreshing state... [id=eks_node_role]
aws_iam_role.eks_role: Refreshing state... [id=eks_role]
aws_iam_role_policy_attachment.eks_policy_attachment: Refreshing state... [id=eks_role-20230823124538236800000002]
aws_subnet.private_1: Refreshing state... [id=subnet-0ad346e21fd80cb9a]
aws_subnet.public_2: Refreshing state... [id=subnet-0a8801e13bb79f167]
aws_subnet.public_1: Refreshing state... [id=subnet-0d6339c81dca217aa]
aws_subnet.private_2: Refreshing state... [id=subnet-06fb5c9945d02b01c]
aws_security_group.eks_security_group: Refreshing state... [id=sg-0f1b771c4bf6f2262]
aws_eks_cluster.my_cluster: Refreshing state... [id=my-cluster]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_eks_cluster.my_cluster has been deleted
  - resource "aws_eks_cluster" "my_cluster" {
        id                    = "my-cluster"
      - name                  = "my-cluster" -> null
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_eks_cluster.my_cluster will be created
  + resource "aws_eks_cluster" "my_cluster" {
      + arn                   = (known after apply)
      + certificate_authority = (known after apply)
      + cluster_id            = (known after apply)
      + created_at            = (known after apply)
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + identity              = (known after apply)
      + name                  = "my-cluster"
      + platform_version      = (known after apply)
      + role_arn              = "arn:aws:iam::459978891776:role/eks_role"
      + status                = (known after apply)
      + tags_all              = (known after apply)
      + version               = (known after apply)

      + kubernetes_network_config {
          + ip_family         = (known after apply)
          + service_ipv4_cidr = (known after apply)
          + service_ipv6_cidr = (known after apply)
        }

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + subnet_ids                = [
              + "subnet-06fb5c9945d02b01c",
              + "subnet-0ad346e21fd80cb9a",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # aws_eks_node_group.my_node_group will be created
  + resource "aws_eks_node_group" "my_node_group" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = "my-cluster"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = (known after apply)
      + node_group_name        = "my-node-group"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = "arn:aws:iam::459978891776:role/eks_node_role"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-06fb5c9945d02b01c",
          + "subnet-0ad346e21fd80cb9a",
        ]
      + tags_all               = (known after apply)
      + version                = (known after apply)

      + scaling_config {
          + desired_size = 2
          + max_size     = 3
          + min_size     = 1
        }

      + update_config {
          + max_unavailable            = (known after apply)
          + max_unavailable_percentage = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.eks_node_policy_attachment will be destroyed
  # (because aws_iam_role_policy_attachment.eks_node_policy_attachment is not in configuration)
  - resource "aws_iam_role_policy_attachment" "eks_node_policy_attachment" {
      - id         = "eks_node_role-20230823124538213800000001" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy" -> null
      - role       = "eks_node_role" -> null
    }

  # aws_iam_role_policy_attachment.eks_node_policy_attachment_container will be created
  + resource "aws_iam_role_policy_attachment" "eks_node_policy_attachment_container" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "eks_node_role"
    }

  # aws_iam_role_policy_attachment.eks_node_policy_attachment_worker will be created
  + resource "aws_iam_role_policy_attachment" "eks_node_policy_attachment_worker" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = "eks_node_role"
    }

Plan: 4 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @Gluppe, Action: `pull_request`*